import { Injectable } from "@angular/core";
@Injectable({
    providedIn: 'root',
})
export class precipitationService {
    // 动态计算柱形图的高度
    lineMaxheight() {
        let data = this.precipitationData;
        const maxValue = Math.max(...data.map(item => item.value));
        return 3 / maxValue;
    }
    // 柱状体的主干
    lineData() {
        let data = this.precipitationData;
        return data.map((item) => {
            return {
                coords: [this.geoCoordMap[item.name], [this.geoCoordMap[item.name][0], this.geoCoordMap[item.name][1] + item.value * this.lineMaxheight()]]
            };
        });
    }
    // 柱状体的顶部
    scatterData() {
        return this.precipitationData.map((item) => {
            return [this.geoCoordMap[item.name][0], this.geoCoordMap[item.name][1] + item.value * this.lineMaxheight()];
        });
    }
    // 柱状体的底部
    scatterData2() {
        return this.precipitationData.map((item) => {
            return {
                name: item.name,
                value: this.geoCoordMap[item.name],
            };
        });
    }
    sortPreciDate(data){
        data.sort(function(a,b){
            return a.value-b.value;
        })
        
    }
    getCityNames(preciData: any) {
        this.sortPreciDate(preciData);
        if (!preciData)
            return ''
        return (
            preciData.map(keys => {
                return keys.name;
            })
        )
    }
    getCityValues(preciData: any) {
        if (!preciData)
            return ''
        return (
            preciData.map(keys => {
                return keys.value;
            })
        )
    }
    geoCoordMap = {
        北京市: [116.405285, 39.904989],
        天津市: [117.190182, 39.125596],
        河北省: [114.502461, 38.045474],
        山西省: [112.549248, 37.857014],
        内蒙古自治区: [111.670801, 40.818311],
        辽宁省: [123.429096, 41.796767],
        吉林省: [125.3245, 43.886841],
        黑龙江省: [126.642464, 45.756967],
        上海市: [121.472644, 31.231706],
        江苏省: [118.767413, 32.041544],
        浙江省: [120.153576, 30.287459],
        安徽省: [117.283042, 31.86119],
        福建省: [119.306239, 26.075302],
        江西省: [115.892151, 28.676493],
        山东省: [117.000923, 36.675807],
        河南省: [113.665412, 34.757975],
        湖北省: [114.298572, 30.584355],
        湖南省: [112.982279, 28.19409],
        广东省: [113.280637, 23.125178],
        广西壮族自治区: [108.320004, 22.82402],
        海南省: [110.33119, 20.031971],
        重庆市: [106.504962, 29.533155],
        四川省: [104.065735, 30.659462],
        贵州省: [106.713478, 26.578343],
        云南省: [102.712251, 25.040609],
        西藏自治区: [91.132212, 29.660361],
        陕西省: [108.948024, 34.263161],
        甘肃省: [103.823557, 36.058039],
        青海省: [101.778916, 36.623178],
        宁夏回族自治区: [106.278179, 38.46637],
        新疆维吾尔自治区: [87.617733, 43.792818],
    };
    precipitationData = [
        { name: "北京市", value: 164929 },
        { name: "天津市", value: 101543 },
        { name: "河北省", value: 48528 },
        { name: "山西省", value: 50550 },
        { name: "内蒙古自治区", value: 72183 },
        { name: "辽宁省", value: 58969 },
        { name: "吉林省", value: 51125 },
        { name: "黑龙江省", value: 42997 },
        { name: "上海市", value: 155561.3 },
        { name: "江苏省", value: 121202 },
        { name: "浙江省", value: 100067 },
        { name: "安徽省", value: 63380 },
        { name: "福建省", value: 105691 },
        { name: "江西省", value: 56853 },
        { name: "山东省", value: 72027 },
        { name: "河南省", value: 54997.07 },
        { name: "湖北省", value: 43443.46 },
        { name: "湖南省", value: 41781.49 },
        { name: "广东省", value: 110760.9 },
        { name: "广西壮族自治区", value: 22156.60 },
        { name: "海南省", value: 5532.39 },
        { name: "重庆市", value: 25002.79 },
        { name: "四川省", value: 48598.8 },
        { name: "贵州省", value: 17826.56 },
        { name: "云南省", value: 24500 },
        { name: "西藏自治区", value: 1697.82 },
        { name: "陕西省", value: 26181.86 },
        { name: "甘肃省", value: 9016.7 },
        { name: "青海省", value: 3005.92 },
        { name: "宁夏回族自治区", value: 3021.55 },
        { name: "新疆维吾尔自治区", value: 13797.58 },
    ];
    deadData=[
        { name: "北京市", value: 560 },
        { name: "天津市", value: 534.4 },
        { name: "河北省", value: 546.7 },
        { name: "山西省", value: 561.3 },
        { name: "内蒙古自治区", value: 311.2 },
        { name: "辽宁省", value: 748 },
        { name: "吉林省", value: 769.1 },
        { name: "黑龙江省", value: 723.1 },
        { name: "上海市", value: 1554.6 },
        { name: "江苏省", value: 1236 },
        { name: "浙江省", value: 1701 },
        { name: "安徽省", value: 1665.6 },
        { name: "福建省", value: 1439.1 },
        { name: "江西省", value: 1853.1 },
        { name: "山东省", value: 838.1 },
        { name: "河南省", value: 874.3 },
        { name: "湖北省", value: 1542.6 },
        { name: "湖南省", value: 1726.8 },
        { name: "广东省", value: 1574.1 },
        { name: "广西壮族自治区", value: 1669.4 },
        { name: "海南省", value: 1641.1 },
        { name: "重庆市", value: 1435.6 },
        { name: "四川省", value: 1055 },
        { name: "贵州省", value: 1417.4 },
        { name: "云南省", value: 1157.2 },
        { name: "西藏自治区", value: 600.6 },
        { name: "陕西省", value: 690.5 },
        { name: "甘肃省", value: 334.4 },
        { name: "青海省", value: 367.1 },
        { name: "宁夏回族自治区", value: 309.7 },
        { name: "新疆维吾尔自治区", value: 141.7 },
    ]
    constructor() { }
    precipitationLine800 = [{
        coords: [
            [
                121.044338,
                53.379636
            ],
            [
                120.978966,
                51.238776
            ],
            [
                121.463713,
                50.202831
            ],
            [
                121.189558,
                48.552431
            ],
            [
                121.042472,
                47.751756
            ],
            [
                120.205474,
                47.127133
            ],
            [
                121.026129,
                45.586202
            ],
            [
                122.569493,
                45.112147
            ],
            [
                122.376996,
                43.895989
            ],
            [
                116.443426,
                41.685286
            ],
            [
                112.891969,
                39.296861
            ],
            [
                112.547014,
                40.880188
            ],
            [
                111.65013,
                41.606433
            ],
            [
                110.753246,
                40.723515
            ],
            [
                111.305175,
                40.40906
            ],
            [
                112.271049,
                40.093128
            ],
            [
                111.65013,
                39.93461
            ],
            [
                110.891228,
                39.668719
            ],
            [
                109.856362,
                38.112446
            ],
            [
                109.580398,
                37.676898
            ],
            [
                107.234701,
                36.632186
            ],
            [
                104.061121,
                36.076573
            ],
            [
                102.888273,
                35.516994
            ],
            [
                100.059639,
                35.685281
            ],
            [
                98.541836,
                35.066501
            ],
            [
                96.541105,
                34.10093
            ],
            [
                94.609355,
                33.928426
            ],
            [
                92.677605,
                34.329103
            ],
            [
                91.504757,
                33.872327
            ],
            [
                89.77998,
                33.470194
            ],
            [
                88.676123,
                33.585804
            ],
            [
                87.196161,
                33.249003
            ],
            [
                85.81634,
                31.559915
            ],
            [
                84.815969,
                31.324472
            ],
            [
                84.50551,
                30.673455
            ],
            [
                85.436889,
                30.435743
            ],
            [
                87.610108,
                30.257709
            ],
            [
                90.162777,
                29.599731
            ],
            [
                89.748831,
                28.756997
            ],
            [
                87.679099,
                28.635683
            ],
            [
                80.848983,
                30.555218
            ]
        ],
    }]
    precipitationLine400 = [
        {
            coords: [
                [
                    119.166339,
                    35.146568
                ],
                [
                    117.068481,
                    34.580385
                ],
                [
                    116.305822,
                    34.055475
                ],
                [
                    115.924493,
                    33.049155
                ],
                [
                    114.20851,
                    32.621951
                ],
                [
                    112.301862,
                    32.728944
                ],
                [
                    110.903654,
                    32.514829
                ],
                [
                    108.425013,
                    32.782393
                ],
                [
                    106.58192,
                    33.208825
                ],
                [
                    104.865937,
                    32.942547
                ],
                [
                    103.277064,
                    32.246466
                ],
                [
                    102.794438,
                    31.618117
                ],
                [
                    101.710028,
                    31.796555
                ],
                [
                    101.130755,
                    30.441753
                ],
                [
                    100.708381,
                    29.704865
                ],
                [
                    100.771936,
                    28.459465
                ],
                [
                    100.323075,
                    27.043251
                ],
                [
                    100.518381,
                    26.422965
                ],
                [
                    101.236684,
                    26.081995
                ],
                [
                    101.001336,
                    25.705004
                ],
                [
                    100.151466,
                    25.705007
                ],
                [
                    99.412733,
                    26.175891
                ],
                [
                    99.249296,
                    26.410686
                ],
                [
                    99.301596,
                    28.176858
                ],
                [
                    98.464801,
                    28.497378
                ],
                [
                    95.143772,
                    30.773654
                ],
                [
                    94.372351,
                    29.756634
                ],
                [
                    91.770443,
                    28.037299
                ]
            ],
        },
    ]

}
